<?php
session_start(); // Έναρξη της σύνδεσης με τη συνεδρία για να μπορέσουμε να την τερματίσουμε

session_unset(); // Αφαιρεί όλες τις μεταβλητές που είναι αποθηκευμένες στη συνεδρία (π.χ. user_id, user_name)

session_destroy(); // Καταστρέφει οριστικά τα δεδομένα της συνεδρίας από τον διακομιστή

// Ανακατεύθυνση του χρήστη στην αρχική σελίδα μετά την αποσύνδεση
header("Location: index.php");
exit(); // Τερματισμός του script για να διασφαλιστεί ότι δεν θα εκτελεστεί επιπλέον κώδικας
?>